<a href="https://colab.research.google.com/github/YapingWu/GoogleColab/blob/main/data_analysis/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas数据处理

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

data = ['L8 D1 ', 'L3 D3 ', 'L7 ', 'L6 D1 ', 'L7 D1 ', 'D6 ', 'D3 L3 ']
df = pd.DataFrame(data, columns=['unit'])
df['unit'] = df['unit'].apply(lambda x: x.strip())
df['len'] = df['unit'].apply(lambda x: len(x.split(" ")))
df['cnt'] = 1

df1 = df.groupby('len')['cnt'].sum().reset_index()
print(df1.head(5))

# plot函数作图
plt.plot(df1['len'], df1['cnt'], marker='*') 
plt.xlabel("unit len")
plt.ylabel("cnt") 

# show函数展示出这个图，如果没有这行代码，则程序完成绘图，但看不到
plt.show()

# pandas cut。将数据分割成多个区间。   
参考：[cut使用总结](https://www.cnblogs.com/sench/p/10128216.html)

In [16]:
import numpy as np
import pandas as pd

ages = np.array([1,5,10,40,36,12,58,62,77,89,100,18,20,25,30,32])
df = pd.DataFrame(ages, columns=['age'])

#  将ages平均分为5个区间
df['categories'] = pd.cut(df['age'], 5)
# 指定区间进行分割
df['categories1'] = pd.cut(df['age'], [0,5,20,30,50,100])
print(df.head(5))

   age     categories categories1
0    1  (0.901, 20.8]      (0, 5]
1    5  (0.901, 20.8]      (0, 5]
2   10  (0.901, 20.8]     (5, 20]
3   40   (20.8, 40.6]    (30, 50]
4   36   (20.8, 40.6]    (30, 50]

# groupby

In [19]:
# 统计每个分组中数据条数
df.groupby('categories1').size().reset_index()

  categories1  0
0      (0, 5]  2
1     (5, 20]  4
2    (20, 30]  2
3    (30, 50]  3
4   (50, 100]  5

In [21]:
df['categories1'].value_counts().reset_index()

       index  categories1
0  (50, 100]            5
1    (5, 20]            4
2   (30, 50]            3
3   (20, 30]            2
4     (0, 5]            2